// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6;

Console.WriteLine("Введите число");
int number1 = int.Parse(Console.ReadLine());

while (number1 / 10 )
{
      
}